Tekla.Structures.Drawing.ViewMarkBasicSymbolAttributes
The ViewMarkBasicSymbolAttributes class contains basic attributes for mark symbols.

Tekla.Structures.Drawing.ViewMarkBasicSymbolAttributes.Size
The size of the mark symbol.

Tekla.Structures.Drawing.ViewMarkBasicSymbolAttributes.Shape
The shape of the mark symbol.

Tekla.Structures.Drawing.ViewMarkBasicSymbolAttributes.#ctor
Creates a new mark symbol attributes instance.

Tekla.Structures.Drawing.ViewMarkBasicSymbolAttributes.#ctor(System.Double,Tekla.Structures.Drawing.MarkSymbolShape)
Creates a new mark symbol attributes instance with the given size and shape.
size: The size of the mark symbol to be used.
shape: The shape of the mark symbol to be used.

Tekla.Structures.Drawing.ViewMarkBasicSymbolAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.